БухЭксп/Catalogs/CW_ШаблоныСинхронизацииГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ШаблоныСинхронизацииГрузоперевозок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СоставПолей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ИменаПолейCинхронизацииГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеПриоритета</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ШаблоныСинхронизацииГрузоперевозок/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокРеквизитовДляВыбора(); 
	
КонецПроцедуры  

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьЗначенияДополительныхКолонок(ТекущийОбъект); 
	
КонецПроцедуры  

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого СтрокаСостава из Объект.СоставПолей Цикл
		ИндексСтроки = Объект.СоставПолей.Индекс(СтрокаСостава);	
		
		СтрокаТекущийОбъект = ТекущийОбъект.СоставПолей[ИндексСтроки];  
		
		Если ТипЗнч(СтрокаСостава.ТекущийПриоритет) = Тип("ФиксированныйМассив") Тогда
			ХранилищеПриоритета = Новый Массив(СтрокаСостава.ТекущийПриоритет);	
		КонецЕсли;    
		
		СтрокаТекущийОбъект.ХранилищеПриоритета = Новый ХранилищеЗначения(ХранилищеПриоритета);
	КонецЦикла;   
	
КонецПроцедуры 

 &НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) 
	
	УстановитьЗначенияДополительныхКолонок(ТекущийОбъект);
	
КонецПроцедуры 


&НаСервере
Процедура УстановитьЗначенияДополительныхКолонок(ТекущийОбъект)
	
	Для Каждого СтрокаТекущийОбъект из ТекущийОбъект.СоставПолей Цикл
		ИндексСтроки = ТекущийОбъект.СоставПолей.Индекс(СтрокаТекущийОбъект);
		
		мПриоритетЗнчения = СтрокаТекущийОбъект.ХранилищеПриоритета.Получить();    
		
		СтрокаОбъект = Объект.СоставПолей[ИндексСтроки];  
		СтрокаОбъект.ЭтоПараметр = (ТипЗнч(СтрокаОбъект.ПолеОбъекта) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок"));
	
		Если мПриоритетЗнчения <> Неопределено Тогда
			СтрокаОбъект.ТекущийПриоритет = Новый ФиксированныйМассив(мПриоритетЗнчения); 
			СтрокаОбъект.ПредставлениеПриоритета = СтрСоединить(мПриоритетЗнчения, ", ");
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры  

&НаКлиенте
Процедура СоставПолейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Отказ = Истина;	
	
КонецПроцедуры  

&НаКлиенте
Процедура ДобавитьРеквизит(Команда)
	
    Описаниеоповещения = Новый Описаниеоповещения("ЗавершитьВыборПоля", ЭтотОбъект);
	
	СписокРеквизитов.ПоказатьВыборЭлемента(Описаниеоповещения, "Доступные реквизиты");

КонецПроцедуры   

&НаКлиенте
Процедура ДобавитьПараметр(Команда)
	
	Описаниеоповещения = Новый Описаниеоповещения("ЗавершитьВыборПоля", ЭтотОбъект);   
	
	СтруктураПараметрыВыбора = Новый Структура;
	СтруктураПараметрыВыбора.Вставить("РежимВыбора", 			Истина);
	СтруктураПараметрыВыбора.Вставить("ЗакрыватьПриВыборе", 	Истина);
	СтруктураПараметрыВыбора.Вставить("МножественныйВыбор", 	Ложь);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора", СтруктураПараметрыВыбора, ЭтаФорма, ,,,Описаниеоповещения);
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗавершитьВыборПоля(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт  
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ЭлементСпискаЗначений") Тогда 
		СтруктураЗначения = Новый Структура;
		СтруктураЗначения.Вставить("Значение", 		ВыбранноеЗначение.Значение);
		СтруктураЗначения.Вставить("Представление", ВыбранноеЗначение.Представление);
		
		ОбработатьВыборПоляНаСервере(СтруктураЗначения);
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда 
		ОбработатьВыборПоляНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборПоляНаСервере(Знач ВыбранноеЗначение)  
	
	Модифицированность = Истина;

	Отбор = Новый Структура;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда
		Отбор.Вставить("ПолеОбъекта", ВыбранноеЗначение);
		ПолеОбъекта 		=  ВыбранноеЗначение;
		ПредставлениеПоля 	= СокрЛП(ВыбранноеЗначение); 
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Отбор.Вставить("ПолеОбъекта", ВыбранноеЗначение.Значение);
		ПредставлениеПоля	=  ВыбранноеЗначение.Представление;
		ПолеОбъекта			=  ВыбранноеЗначение.Значение;
	КонецЕсли;
	
	мСтроки = Объект.СоставПолей.НайтиСтроки(Отбор);
	Если мСтроки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;  
	
	мПриоритет = Новый Массив;
	мПриоритет.Добавить("Грузоперевозка");
	
	СтрокаТаблицы = Объект.СоставПолей.Добавить(); 
	СтрокаТаблицы.ПредставлениеПоля			= ПредставлениеПоля;
	СтрокаТаблицы.ПолеОбъекта				= ПолеОбъекта;
	СтрокаТаблицы.ЭтоПараметр				= (ТипЗнч(ВыбранноеЗначение) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок")); 
	
	Если СтрокаТаблицы.ЭтоПараметр Тогда
		СтрокаТаблицы.ТекущийПриоритет 			= Новый ФиксированныйМассив(мПриоритет);
		СтрокаТаблицы.ПредставлениеПриоритета 	= СтрСоединить(мПриоритет, ", ");
	КонецЕсли;
	
КонецПроцедуры    


&НаКлиенте
Процедура СоставПолейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.ГиперссылкаЯчейки Тогда
		СтандартнаяОбработка = Ложь;	
		
		ТекущиеДанные = Элементы.СоставПолей.ТекущиеДанные;     
		Если Не ТекущиеДанные.ЭтоПараметр Тогда
			Возврат;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаверщитьВыборПриоритета", ЭтотОбъект, ДополнительныеПараметры);  
		
		СтруктураПарамтеров = Новый Структура;
		СтруктураПарамтеров.Вставить("ТекущийПриоритет", ТекущиеДанные.ТекущийПриоритет);
		
		ОткрытьФорму("Справочник.CW_ШаблоныСинхронизацииГрузоперевозок.Форма.ФормаВыбораПриоритета", СтруктураПарамтеров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗаверщитьВыборПриоритета(ВыбранныеЗначения, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеЗначения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаверщитьВыборПриоритетанаСервере(ВыбранныеЗначения, ДополнительныеПараметры);
	
КонецПроцедуры  

&НаСервере
Процедура ЗаверщитьВыборПриоритетанаСервере(ВыбранныеЗначения, ДополнительныеПараметры)  
	
	СтрокаТекущая = Объект.СоставПолей.НайтиПоИдентификатору(ДополнительныеПараметры.ВыбраннаяСтрока);
	СтрокаТекущая.ТекущийПриоритет 			= Новый ФиксированныйМассив(ВыбранныеЗначения);
	СтрокаТекущая.ПредставлениеПриоритета 	= СтрСоединить(ВыбранныеЗначения, ", ");
	
	Модифицированность = Истина;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСписокРеквизитовДляВыбора()  
	
	мИсключения = Новый Массив;
	мИсключения.Добавить("ИмяПредопределенныхДанных");
	мИсключения.Добавить("Предопределенный");
	мИсключения.Добавить("ПометкаУдаления");
	мИсключения.Добавить("Родитель"); 
	
	МетаданныеСсылки 	= Метаданные.Справочники.CW_Грузоперевозки;
	Для Каждого Реквизит из МетаданныеСсылки.СтандартныеРеквизиты Цикл 
		Если мИсключения.Найти(Реквизит.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СписокРеквизитов.Добавить(Реквизит.Имя, Реквизит.Представление(), , БиблиотекаКартинок.Реквизит);	
	КонецЦикла;  
	
	Для Каждого Реквизит из МетаданныеСсылки.Реквизиты Цикл
		Если мИсключения.Найти(Реквизит.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;  
		
		СписокРеквизитов.Добавить(Реквизит.Имя, Реквизит.Представление(), ,БиблиотекаКартинок.Реквизит);	
	КонецЦикла;
	
КонецПроцедуры
